In [2]:
#!pip3 install mysql-connector-python
import mysql.connector
import pandas as pd
import sqlalchemy

# Complete the eda with SQL

### Connect with sql.connector

In [27]:
conn = mysql.connector.connect(host="localhost",user="root",password="12345",database="SPACE_Y")

In [32]:
if conn.is_connected(): conn.close()
print(conn.is_connected())

False

In [3]:
with conn.cursor() as cur:
    statement = "show databases;"
if conn.is_connected(): conn.close()

In [25]:
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")

In [29]:
connect_t = sqlalchemy.create_engine("mysql+mysqlconnector://root:12345@localhost/SPACE_Y")
df.to_sql("SPACEX", con = connect_t, if_exists="replace")

101

In [35]:
# creo una tabla con los valores de la tabla SPACEX que no tengan Date null
#%load_ext sql
connect_db = "mysql+mysqlconnector://root:12345@localhost/SPACE_Y"
%sql {connect_db}
%sql create table SPACEXTABLE as select * from SPACEX where Date is not null;

 * mysql+mysqlconnector://root:***@localhost/SPACE_Y
101 rows affected.

[]

In [37]:
%sql show columns from SPACEXTABLE

 * mysql+mysqlconnector://root:***@localhost/SPACE_Y
11 rows affected.

[('index', 'bigint', 'YES', '', None, ''),
 ('Date', 'text', 'YES', '', None, ''),
 ('Time (UTC)', 'text', 'YES', '', None, ''),
 ('Booster_Version', 'text', 'YES', '', None, ''),
 ('Launch_Site', 'text', 'YES', '', None, ''),
 ('Payload', 'text', 'YES', '', None, ''),
 ('PAYLOAD_MASS__KG_', 'bigint', 'YES', '', None, ''),
 ('Orbit', 'text', 'YES', '', None, ''),
 ('Customer', 'text', 'YES', '', None, ''),
 ('Mission_Outcome', 'text', 'YES', '', None, ''),
 ('Landing_Outcome', 'text', 'YES', '', None, '')]

In [44]:
%sql select distinct(Launch_Site) from SPACEXTABLE;

 * mysql+mysqlconnector://root:***@localhost/SPACE_Y
4 rows affected.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]

In [46]:
%sql select Launch_Site from SPACEXTABLE where Launch_Site like "CCA%" limit 5

 * mysql+mysqlconnector://root:***@localhost/SPACE_Y
5 rows affected.

[('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',)]

In [52]:
%sql select sum(PAYLOAD_MASS__KG_) as "Mass total for NASA (CRS)" from SPACEXTABLE where Customer = "NASA (CRS)"

 * mysql+mysqlconnector://root:***@localhost/SPACE_Y
1 rows affected.

[(Decimal('45596'),)]

In [55]:
%sql select avg(PAYLOAD_MASS__KG_) as "Mean for booster version F9 v1.1" from SPACEXTABLE where Booster_Version like "F9 v1.1%"

 * mysql+mysqlconnector://root:***@localhost/SPACE_Y
1 rows affected.

[(Decimal('2534.6667'),)]

In [56]:
%sql select min(Date) from SPACEXTABLE where Mission_Outcome ="Success"

 * mysql+mysqlconnector://root:***@localhost/SPACE_Y
1 rows affected.

[('2010-06-04',)]

In [64]:
%sql select Booster_Version  from SPACEXTABLE where Mission_Outcome ="Success" and (PAYLOAD_MASS__KG_ between 4000 and 5999)

 * mysql+mysqlconnector://root:***@localhost/SPACE_Y
22 rows affected.

[('F9 v1.1',),
 ('F9 v1.1 B1011',),
 ('F9 v1.1 B1014',),
 ('F9 v1.1 B1016',),
 ('F9 FT B1020',),
 ('F9 FT B1022',),
 ('F9 FT B1026',),
 ('F9 FT B1030',),
 ('F9 FT  B1021.2',),
 ('F9 FT B1032.1',),
 ('F9 B4 B1040.1',),
 ('F9 FT  B1031.2',),
 ('F9 FT  B1032.2',),
 ('F9 B4  B1040.2',),
 ('F9 B5 B1046.2',),
 ('F9 B5 B1047.2',),
 ('F9 B5 B1046.3',),
 ('F9 B5 B1048.3',),
 ('F9 B5 B1051.2 ',),
 ('F9 B5B1060.1',),
 ('F9 B5 B1058.2 ',),
 ('F9 B5B1062.1',)]

In [114]:
%sql select count(Mission_Outcome) as Success,(select count(Mission_Outcome) from SPACEXTABLE where Mission_Outcome like "%Fa%") as Failure  from SPACEXTABLE where Mission_Outcome like "%Suc%"

 * mysql+mysqlconnector://root:***@localhost/SPACE_Y
1 rows affected.

[(100, 1)]

In [107]:
%sql select Mission_Outcome, count(Mission_Outcome) as count from SPACEXTABLE group by Mission_Outcome

 * mysql+mysqlconnector://root:***@localhost/SPACE_Y
4 rows affected.

[('Success', 98),
 ('Failure (in flight)', 1),
 ('Success (payload status unclear)', 1),
 ('Success ', 1)]

In [110]:
%sql select Booster_Version, PAYLOAD_MASS__KG_ from SPACEXTABLE where PAYLOAD_MASS__KG_ = (select max(PAYLOAD_MASS__KG_) from SPACEXTABLE)

 * mysql+mysqlconnector://root:***@localhost/SPACE_Y
12 rows affected.

[('F9 B5 B1048.4', 15600),
 ('F9 B5 B1049.4', 15600),
 ('F9 B5 B1051.3', 15600),
 ('F9 B5 B1056.4', 15600),
 ('F9 B5 B1048.5', 15600),
 ('F9 B5 B1051.4', 15600),
 ('F9 B5 B1049.5', 15600),
 ('F9 B5 B1060.2 ', 15600),
 ('F9 B5 B1058.3 ', 15600),
 ('F9 B5 B1051.6', 15600),
 ('F9 B5 B1060.3', 15600),
 ('F9 B5 B1049.7 ', 15600)]

In [126]:
%sql select monthname(Date), Landing_Outcome, Booster_Version, Launch_Site from SPACEXTABLE  where Landing_Outcome="Failure (drone ship)" and year(Date) = 2015

 * mysql+mysqlconnector://root:***@localhost/SPACE_Y
2 rows affected.

[('January', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('April', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40')]

In [186]:
%sql select Landing_Outcome, count(Landing_Outcome) as conteo from SPACEXTABLE where (Date between "2010-06-04" and "2017-03-20") and Landing_Outcome in ("Failure (drone ship)","Success (ground pad)") group by Landing_Outcome order by conteo desc

 * mysql+mysqlconnector://root:***@localhost/SPACE_Y
2 rows affected.

[('Failure (drone ship)', 5), ('Success (ground pad)', 3)]

In [190]:
%sql select distinct(Launch_Site) from SPACEXTABLE

 * mysql+mysqlconnector://root:***@localhost/SPACE_Y
4 rows affected.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]

In [187]:
%sql describe SPACEXTABLE

 * mysql+mysqlconnector://root:***@localhost/SPACE_Y
11 rows affected.

[('index', 'bigint', 'YES', '', None, ''),
 ('Date', 'text', 'YES', '', None, ''),
 ('Time (UTC)', 'text', 'YES', '', None, ''),
 ('Booster_Version', 'text', 'YES', '', None, ''),
 ('Launch_Site', 'text', 'YES', '', None, ''),
 ('Payload', 'text', 'YES', '', None, ''),
 ('PAYLOAD_MASS__KG_', 'bigint', 'YES', '', None, ''),
 ('Orbit', 'text', 'YES', '', None, ''),
 ('Customer', 'text', 'YES', '', None, ''),
 ('Mission_Outcome', 'text', 'YES', '', None, ''),
 ('Landing_Outcome', 'text', 'YES', '', None, '')]

### Connect with ipython-sql, sql-magic

In [22]:
connet_url = sqlalchemy.create_engine("mysql+mysqlconnector://root:12345@localhost")
con2 = "mysql+mysqlconnector://root:12345@localhost/tareaSql"
con3 = "mysql+mysqlconnector://root:12345@localhost/"

In [23]:
%sql {con3}

In [26]:
a

NameError: name 'a' is not defined